99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_smartconfig/esp32_mquickjs_wifi_smartconfig.c
#include "esp32_mquickjs_wifi_smartconfig.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_wifi_smartconfig_session.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <stdio.h>
#include <string.h>

typedef enum { SC_RECEIVE, SC_CLOSE } sc_operation_t;
typedef struct {
    esp32_mquickjs_wifi_smartconfig_decoder_options_t decoder;
    uint32_t timeout_ms;
    uint8_t key[16];
    bool allow_ap_channel_change, auto_connect;
    esp32_mquickjs_wifi_smartconfig_connection_options_t connection;
} sc_options_t;
struct esp32_mquickjs_future_driver_state {
    esp32_mquickjs_wifi_smartconfig_session_t *session;
    sc_operation_t operation;
    uint32_t timeout_ms;
    int64_t deadline_us;
    bool started, cancelled, wait_timed_out, observation_registered;
};
#define SET(object, name, value) do { if (!esp32_mquickjs_set_property_ref(ctx, object, name, value)) goto fail; } while (0)

static bool sc_options(JSContext *ctx, JSGCRef *root, sc_options_t *options)
{
    static const char *const keys[] = {"protocol", "fastMode", "channelTimeoutSeconds", "aesKey", "timeoutMs", "allowApChannelChange",
        "autoConnect", "connectionTimeoutMs", "allowOpenNetwork", "minimumAuthMode", "pmf"};
    static const char *const protocols[] = {"esptouch", "airkiss", "esptouch-airkiss", "esptouch-v2"};
    *options = (sc_options_t){.decoder = {.type = SC_TYPE_ESPTOUCH, .channel_timeout_s = 15}, .timeout_ms = 120000,
        .connection = {.timeout_ms = 30000, .minimum_auth = WIFI_AUTH_WPA2_PSK}};
    JSGCRef ref;
    JSValue *field = JS_PushGCRef(ctx, &ref);
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, root->val, "wifi.smartConfig.start", keys, sizeof(keys) / sizeof(keys[0]))) goto done;
#define FIELD(name) do { *field = JS_GetPropertyStr(ctx, root->val, name); if (JS_IsException(*field)) goto done; } while (0)
    FIELD("protocol");
    if (!JS_IsUndefined(*field)) {
        size_t index;
        if (!esp32_mquickjs_value_to_enum(ctx, *field, protocols, 4, &index)) goto invalid;
        static const smartconfig_type_t types[] = {SC_TYPE_ESPTOUCH, SC_TYPE_AIRKISS, SC_TYPE_ESPTOUCH_AIRKISS, SC_TYPE_ESPTOUCH_V2};
        options->decoder.type = types[index];
    }
    FIELD("fastMode");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        options->decoder.fast_mode = (*field == JS_TRUE);
    }
    FIELD("allowApChannelChange");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        options->allow_ap_channel_change = (*field == JS_TRUE);
    }
    FIELD("channelTimeoutSeconds");
    if (!JS_IsUndefined(*field)) {
        uint32_t number;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 15, 255, &number)) goto invalid;
        options->decoder.channel_timeout_s = (uint8_t)number;
    }
    FIELD("timeoutMs");
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &options->timeout_ms)) goto invalid;
    FIELD("autoConnect");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsBool(*field)) goto invalid;
        options->auto_connect = *field == JS_TRUE;
    }
    bool connection_settings = false;
    FIELD("connectionTimeoutMs");
    if (!JS_IsUndefined(*field)) {
        connection_settings = true;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &options->connection.timeout_ms)) goto invalid;
    }
    FIELD("minimumAuthMode");
    if (!JS_IsUndefined(*field)) {
        connection_settings = true;
        const char *const names[] = {"wpa2-psk", "wpa3-psk"};
        size_t index;
        if (!esp32_mquickjs_value_to_enum(ctx, *field, names, 2, &index)) goto invalid;
        options->connection.minimum_auth = index ? WIFI_AUTH_WPA3_PSK : WIFI_AUTH_WPA2_PSK;
        options->connection.pmf_required = index != 0;
    }
    FIELD("pmf");
    if (!JS_IsUndefined(*field)) {
        connection_settings = true;
        const char *const names[] = {"optional", "required"};
        size_t index;
        if (!esp32_mquickjs_value_to_enum(ctx, *field, names, 2, &index)) goto invalid;
        options->connection.pmf_required = index != 0;
    }
    FIELD("allowOpenNetwork");
    if (!JS_IsUndefined(*field)) {
        connection_settings = true;
        if (!JS_IsBool(*field)) goto invalid;
        options->connection.allow_open = *field == JS_TRUE;
    }
    if ((!options->auto_connect && connection_settings) || (options->auto_connect &&
        esp32_mquickjs_wifi_smartconfig_connection_validate_options(&options->connection) != ESP_OK)) goto invalid;
    FIELD("aesKey");
    if (!JS_IsUndefined(*field)) {
        if (!JS_IsString(ctx, *field)) goto invalid;
        JSCStringBuf buffer;
        size_t length = 0;
        const char *key = JS_ToCStringLen(ctx, &length, *field, &buffer);
        if (!key || length != sizeof(options->key) || memchr(key, 0, length)) goto invalid;
        memcpy(options->key, key, sizeof(options->key));
        options->decoder.key = options->key; options->decoder.key_length = sizeof(options->key);
    }
    if (esp32_mquickjs_wifi_smartconfig_decoder_validate_options(&options->decoder) != ESP_OK) goto invalid;
    ok = true; goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid SmartConfig options");
done:
    if (!ok) esp32_mquickjs_wireless_secure_zero(options, sizeof(*options));
    JS_PopGCRef(ctx, &ref); return ok;
#undef FIELD
}

static esp32_mquickjs_wifi_smartconfig_session_t *sc_receiver(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_SMARTCONFIG_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiSmartConfigSession"); return NULL;
    }
    esp32_mquickjs_wifi_smartconfig_session_t *session = JS_GetOpaque(ctx, value);
    if (!session) JS_ThrowReferenceError(ctx, "invalid WiFiSmartConfigSession");
    return session;
}
void js_wifi_smartconfig_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    /* Pending Future references keep the session alive. The registry requests
     * close when the final external reference, including those Futures, drops. */
    esp32_mquickjs_wifi_smartconfig_session_release(opaque);
}
JSValue js_wifi_smartconfig_constructor(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.smartConfig.start()");
}
static JSValue sc_identity(JSContext *ctx, uint64_t identity)
{
    if (!identity) return JS_NULL;
    JSGCRef ref;
    JSValue *value = JS_PushGCRef(ctx, &ref);
    *value = JS_NewObject(ctx);
    if (JS_IsException(*value)) goto fail;
    SET(value, "low", JS_NewUint32(ctx, (uint32_t)identity));
    SET(value, "high", JS_NewUint32(ctx, (uint32_t)(identity >> 32)));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue sc_status_to_js(JSContext *ctx, const esp32_mquickjs_wifi_smartconfig_session_status_t *s)
{
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "state", JS_NewString(ctx, s->closing ? s->retired ? "closed" : "closing" :
        s->error ? "faulted" : s->completed ? "completed" :
        (s->auto_connect && s->credentials_ready) ? "connecting" : s->credentials_ready ? "credentials-ready" : s->native.decoder.started ? "listening" : "opening"));
    SET(result, "operation", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.identity) : JS_NULL);
    SET(result, "radioGeneration", s->native.operation.identity ? JS_NewUint32(ctx, s->native.operation.generation) : JS_NULL);
    SET(result, "decoderIdentity", sc_identity(ctx, s->native.decoder.token.identity));
    SET(result, "autoConnect", JS_NewBool(s->auto_connect));
    SET(result, "connectionGeneration", s->connection_generation ? JS_NewUint32(ctx, s->connection_generation) : JS_NULL);
    SET(result, "connectionStarted", JS_NewBool(s->connection_started));
    SET(result, "connectionTransferred", JS_NewBool(s->connection_transferred));
    SET(result, "connectionReason", JS_NewInt32(ctx, s->connection_reason));
    SET(result, "ackRequested", JS_NewBool(s->ack_requested));
    SET(result, "ackCompleted", JS_NewBool(s->connection_transferred || s->native.decoder.ack_completed));
    SET(result, "completed", JS_NewBool(s->completed));
    SET(result, "workerBusy", JS_NewBool(s->worker_busy));
    SET(result, "driverStarted", JS_NewBool(s->native.decoder.started));
    SET(result, "scanDone", JS_NewBool(s->native.events.scan_done));
    SET(result, "channelFound", JS_NewBool(s->native.events.channel_found));
    SET(result, "credentialsReady", JS_NewBool(s->credentials_ready && !s->closing && !s->credentials_consumed && (!s->auto_connect || s->completed)));
    SET(result, "credentialsConsumed", JS_NewBool(s->credentials_consumed));
    SET(result, "captureStopped", JS_NewBool(s->native.decoder.capture_stopped));
    SET(result, "channelRestored", JS_NewBool(s->native.channel_restored));
    SET(result, "eventFenced", JS_NewBool(s->native.event_fenced));
    SET(result, "homeChannel", s->native.home_primary ? JS_NewUint32(ctx, s->native.home_primary) : JS_NULL);
    SET(result, "closeRequested", JS_NewBool(s->closing));
    SET(result, "cleanupPending", JS_NewBool(s->closing && !s->retired));
    SET(result, "timedOut", JS_NewBool(s->timed_out));
    SET(result, "handoffUnknown", JS_NewBool(s->native.decoder.handoff_unknown));
    SET(result, "reservedBytes", JS_NewUint32(ctx, s->reserved_bytes));
    SET(result, "capturedEvents", JS_NewUint32(ctx, s->native.events.captured_events));
    SET(result, "duplicateCredentials", JS_NewUint32(ctx, s->native.events.duplicate_credentials));
    SET(result, "discardedEvents", JS_NewUint32(ctx, s->native.events.discarded_events));
    SET(result, "error", s->error ? JS_NewInt32(ctx, s->error) : JS_NULL);
    SET(result, "stage", s->stage ? JS_NewString(ctx, s->stage) : JS_NULL);
    SET(result, "cleanupError", s->cleanup_error ? JS_NewInt32(ctx, s->cleanup_error) : JS_NULL);
    SET(result, "cleanupStage", s->cleanup_stage ? JS_NewString(ctx, s->cleanup_stage) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
#define SC_WATCH_HANDLES 4U
#define SC_WATCH_CAPACITY 16U
typedef struct {
    uint32_t sequence;
    esp32_mquickjs_wifi_smartconfig_session_status_t status;
} sc_watch_event_t;
