99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_smartconfig/esp32_mquickjs_wifi_smartconfig.c
typedef struct {
    esp32_mquickjs_event_queue_t *queue;
    esp32_mquickjs_wifi_smartconfig_session_t *session;
    sc_watch_event_t last;
    bool context_bound;
} sc_watch_source_t;
static portMUX_TYPE s_sc_watch_lock = portMUX_INITIALIZER_UNLOCKED;
static sc_watch_source_t *s_sc_watch_sources[SC_WATCH_HANDLES];
static unsigned s_sc_watch_handles;

/* Compare semantic fields, never padding or the transient worker-busy bit.
 * Every queued pointer is a framework stage string with static lifetime. */
static bool sc_watch_same(const esp32_mquickjs_wifi_smartconfig_session_status_t *a,
    const esp32_mquickjs_wifi_smartconfig_session_status_t *b)
{
#define SAME(field) if (a->field != b->field) return false
    SAME(error); SAME(cleanup_error); SAME(stage); SAME(cleanup_stage);
    SAME(credentials_ready); SAME(credentials_consumed); SAME(closing); SAME(retired); SAME(timed_out);
    SAME(auto_connect); SAME(connection_started); SAME(connection_transferred); SAME(completed);
    SAME(connection_generation); SAME(connection_reason); SAME(ack_requested);
    SAME(native.operation.identity); SAME(native.operation.generation);
    SAME(native.decoder.token.identity); SAME(native.decoder.started); SAME(native.decoder.capture_stopped);
    SAME(native.decoder.handoff_unknown); SAME(native.decoder.ack_completed);
    SAME(native.events.scan_done); SAME(native.events.channel_found);
    SAME(native.events.captured_events); SAME(native.events.duplicate_credentials); SAME(native.events.discarded_events);
    SAME(native.channel_restored); SAME(native.event_fenced); SAME(native.home_primary);
#undef SAME
    return true;
}

static void sc_watch_closed(void *opaque)
{
    sc_watch_source_t *source = opaque;
    portENTER_CRITICAL(&s_sc_watch_lock);
    for (unsigned i = 0; i < SC_WATCH_HANDLES; ++i)
        if (s_sc_watch_sources[i] == source) s_sc_watch_sources[i] = NULL;
    esp32_mquickjs_wifi_smartconfig_session_t *session = source->session;
    source->session = NULL;
    bool bound = source->context_bound;
    if (!bound) --s_sc_watch_handles;
    portEXIT_CRITICAL(&s_sc_watch_lock);
    if (session) esp32_mquickjs_wifi_smartconfig_session_release(session);
    /* Only a private queue construction failure uses this path. No receiver
     * or producer has seen it; its deferred close owns the failed context. */
    if (!bound) esp32_mquickjs_memory_payload_free(source);
}

static void sc_watch_destroyed(void *opaque)
{
    portENTER_CRITICAL(&s_sc_watch_lock);
    --s_sc_watch_handles;
    portEXIT_CRITICAL(&s_sc_watch_lock);
    esp32_mquickjs_memory_payload_free(opaque); /* Budget survives close until queue storage dies. */
}

static JSValue sc_watch_to_js(JSContext *ctx, const void *data, void *opaque)
{
    (void)opaque;
    const sc_watch_event_t *event = data;
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "sequence", JS_NewUint32(ctx, event->sequence));
    SET(result, "status", sc_status_to_js(ctx, &event->status));
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

bool esp32_mquickjs_wifi_smartconfig_poll_observations(bool close)
{
    bool handled = false;
    for (unsigned i = 0; i < SC_WATCH_HANDLES; ++i) {
        esp32_mquickjs_event_queue_t *queue = NULL;
        esp32_mquickjs_wifi_smartconfig_session_t *session = NULL, *detached = NULL;
        portENTER_CRITICAL(&s_sc_watch_lock);
        sc_watch_source_t *source = s_sc_watch_sources[i];
        if (source && esp32_mquickjs_event_queue_retain(source->queue)) {
            queue = source->queue;
            if (!close && esp32_mquickjs_wifi_smartconfig_session_retain(source->session)) session = source->session;
        } else if (source && close) {
            /* A disposed queue already belongs to its reaper. Detach now;
             * its later close callback sees NULL and cannot double-release. */
            s_sc_watch_sources[i] = NULL;
            detached = source->session; source->session = NULL;
        }
        portEXIT_CRITICAL(&s_sc_watch_lock);
        if (detached) esp32_mquickjs_wifi_smartconfig_session_release(detached);
        if (!queue) continue;
        if (close) {
            handled = esp32_mquickjs_event_queue_close(queue) || handled;
        } else if (session) {
            sc_watch_event_t event = {0};
            if (esp32_mquickjs_wifi_smartconfig_session_observation(session, &event.status) &&
                (!source->last.sequence || !sc_watch_same(&source->last.status, &event.status))) {
                if (source->last.sequence == UINT32_MAX) esp32_mquickjs_event_queue_request_close(queue);
                else {
                    event.sequence = source->last.sequence + 1U;
                    source->last = event; /* Drop-newest never retries an old snapshot. */
                    (void)esp32_mquickjs_event_queue_try_send_from_callback(queue, &event);
                    handled = true;
                }
            }
            esp32_mquickjs_wifi_smartconfig_session_release(session);
        }
        esp32_mquickjs_event_queue_release(queue);
    }
    return handled;
}

JSValue js_wifi_smartconfig_watch(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    esp32_mquickjs_wifi_smartconfig_session_t *session = sc_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    if (!esp32_mquickjs_wifi_smartconfig_session_retain(session))
        return JS_ThrowInternalError(ctx, "SmartConfig reference exhausted");
    JSGCRef options_ref, field_ref, queue_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref), *field = JS_PushGCRef(ctx, &field_ref);
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    uint32_t capacity = 8;
    if (argc > 1) goto invalid;
    *options = argc ? argv[0] : JS_UNDEFINED;
    if (!JS_IsUndefined(*options)) {
        static const char *const keys[] = {"capacity"};
        if (!esp32_mquickjs_validate_plain_options(ctx, *options, "WiFiSmartConfigSession.watch", keys, 1)) goto fail;
        *field = JS_GetPropertyStr(ctx, *options, "capacity");
        if (JS_IsException(*field)) goto fail;
        if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, SC_WATCH_CAPACITY, &capacity)) goto invalid;
    }
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    if (!runtime) { JS_ThrowInternalError(ctx, "SmartConfig watch requires an active runtime"); goto fail; }
    sc_watch_source_t *source = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*source), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!source) { JS_ThrowOutOfMemory(ctx); goto fail; }
    unsigned slot = SC_WATCH_HANDLES;
    bool duplicate = false;
    portENTER_CRITICAL(&s_sc_watch_lock);
    for (unsigned i = 0; i < SC_WATCH_HANDLES; ++i) {
        if (!s_sc_watch_sources[i]) slot = i;
        else if (s_sc_watch_sources[i]->session == session) duplicate = true;
    }
    bool available = !duplicate && slot != SC_WATCH_HANDLES && s_sc_watch_handles < SC_WATCH_HANDLES;
    if (available) ++s_sc_watch_handles;
    portEXIT_CRITICAL(&s_sc_watch_lock);
    if (!available) {
        esp32_mquickjs_memory_payload_free(source); JS_ThrowInternalError(ctx, "SmartConfig watch already open or queue budget retained"); goto fail;
    }
    source->session = session; session = NULL; /* Context owns the retained reference. */
    *queue = esp32_mquickjs_event_queue_new_wireless("wifi", ctx, runtime, sizeof(sc_watch_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST, sc_watch_to_js, NULL, sc_watch_closed, source);
    if (JS_IsException(*queue)) { sc_watch_closed(source); goto fail; }
    source->queue = esp32_mquickjs_event_queue_from_value(ctx, *queue);
    source->context_bound = esp32_mquickjs_event_queue_bind_context_release(source->queue, sc_watch_destroyed);
    if (!source->context_bound) {
        /* Dispose owns deferred close; do not free its opaque context here. */
        (void)esp32_mquickjs_event_queue_dispose(ctx, *queue);
        JS_ThrowInternalError(ctx, "SmartConfig queue lifetime binding failed"); goto fail;
    }
    portENTER_CRITICAL(&s_sc_watch_lock);
    s_sc_watch_sources[slot] = source;
    portEXIT_CRITICAL(&s_sc_watch_lock);
    JSValue result = JS_PopGCRef(ctx, &queue_ref);
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &options_ref);
    return result;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "SmartConfig watch capacity must be an integer in 1..16");
fail:
    if (session) esp32_mquickjs_wifi_smartconfig_session_release(session);
    JS_PopGCRef(ctx, &queue_ref); JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &options_ref);
    return JS_EXCEPTION;
}

static JSValue sc_error(JSContext *ctx, const char *operation, esp32_mquickjs_wifi_smartconfig_session_t *session,
    esp_err_t error, bool wait_timeout)
{
    esp32_mquickjs_wifi_smartconfig_session_status_t status = {0};
    if (session) (void)esp32_mquickjs_wifi_smartconfig_session_status(session, &status);
    if (error == ESP_OK) error = status.error ? status.error : ESP_ERR_INVALID_STATE;
    bool timeout = wait_timeout || status.timed_out || error == ESP_ERR_TIMEOUT;
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = sc_status_to_js(ctx, &status);
    if (JS_IsException(*details)) goto fail;
    SET(details, "espCode", JS_NewInt32(ctx, error));
    SET(details, "espName", JS_NewString(ctx, esp_err_to_name(error)));
    SET(details, "waitTimedOut", JS_NewBool(wait_timeout));
    (void)esp32_mquickjs_throw_native_error(ctx, timeout ? "WIFI_SMARTCONFIG_TIMEOUT" :
        status.closing && status.error == ESP_OK ? "WIFI_SMARTCONFIG_CLOSED" : "WIFI_SMARTCONFIG_FAILED",
        operation, "SmartConfig operation did not complete; inspect session status", *details);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_smartconfig_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "SmartConfig status expects no arguments");
    esp32_mquickjs_wifi_smartconfig_session_t *session = sc_receiver(ctx, *self);
    if (!session) return JS_EXCEPTION;
    esp32_mquickjs_wifi_smartconfig_session_status_t status;
    (void)esp32_mquickjs_wifi_smartconfig_session_status(session, &status);
    return sc_status_to_js(ctx, &status);
}
JSValue js_wifi_smartconfig_global_status(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "SmartConfig status expects no arguments");
    esp32_mquickjs_wifi_smartconfig_global_status_t status;
    esp32_mquickjs_wifi_smartconfig_global_status(&status);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "active", JS_NewBool(status.active));
    SET(result, "handles", JS_NewUint32(ctx, status.handles));
    SET(result, "workers", JS_NewUint32(ctx, status.workers));
    SET(result, "runtimeClosing", JS_NewBool(status.runtime_closing));
    SET(result, "session", status.active ? sc_status_to_js(ctx, &status.session) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_smartconfig_capabilities(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self; (void)argv;
    if (argc) return JS_ThrowTypeError(ctx, "SmartConfig capabilities expects no arguments");
    JSGCRef ref, protocols_ref, item_ref;
    JSValue *result = JS_PushGCRef(ctx, &ref), *protocols = JS_PushGCRef(ctx, &protocols_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    *protocols = JS_NewArray(ctx, 0);
    if (JS_IsException(*protocols)) goto fail;
    const char *const names[] = {"esptouch", "airkiss", "esptouch-airkiss", "esptouch-v2"};
    for (unsigned i = 0; i < 4; ++i) {
        *item = JS_NewString(ctx, names[i]);
        if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(ctx, *protocols, i, *item))) goto fail;
    }
    SET(result, "apiVersion", JS_NewString(ctx, "wifi-smartconfig/1"));
    SET(result, "stability", JS_NewString(ctx, "candidate"));
    SET(result, "version", JS_NewString(ctx, esp_smartconfig_get_version()));
    SET(result, "protocols", *protocols);
    SET(result, "espTouchV2", JS_TRUE);
    SET(result, "encryptedV2", JS_TRUE);
    SET(result, "autoConnect", JS_TRUE);
    SET(result, "acknowledgement", JS_TRUE);
    SET(result, "customData", JS_TRUE);
    SET(result, "observations", JS_TRUE);
    SET(result, "maxWatchQueues", JS_NewInt32(ctx, SC_WATCH_HANDLES));
    SET(result, "maxWatchCapacity", JS_NewInt32(ctx, SC_WATCH_CAPACITY));
    SET(result, "maxSessions", JS_NewUint32(ctx, ESP32_MQUICKJS_SMARTCONFIG_MAX_HANDLES));
    SET(result, "maxActiveSessions", JS_NewInt32(ctx, 1));
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &protocols_ref); return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &protocols_ref); JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_smartconfig_start(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{
    (void)self;
    if (argc != 1) return JS_ThrowTypeError(ctx, "wifi.smartConfig.start expects options");
    JSGCRef options_ref, result_ref;
    JSValue *input = JS_PushGCRef(ctx, &options_ref), *result = JS_PushGCRef(ctx, &result_ref);
    *input = argv[0];
    sc_options_t options;
    esp32_mquickjs_wifi_smartconfig_session_t *session = NULL;
    if (!sc_options(ctx, &options_ref, &options)) goto fail;
    esp_err_t error = esp32_mquickjs_wifi_smartconfig_session_create(&options.decoder,
        options.allow_ap_channel_change, options.timeout_ms, &session);
    if (error == ESP_OK && options.auto_connect)
        error = esp32_mquickjs_wifi_smartconfig_session_configure_connection(session, &options.connection);
    esp32_mquickjs_wireless_secure_zero(&options, sizeof(options));
    if (error != ESP_OK) { (void)sc_error(ctx, "wifi.smartConfig.start", session, error, false); goto fail; }
    *result = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_SMARTCONFIG_SESSION);
    if (JS_IsException(*result)) goto fail;
    JS_SetOpaque(ctx, *result, session);
    error = esp32_mquickjs_wifi_smartconfig_session_activate(session);
    if (error != ESP_OK) {
        JS_SetOpaque(ctx, *result, NULL);
        (void)sc_error(ctx, "wifi.smartConfig.start", session, error, false); goto fail;
    }
    /* No JS allocations after activation. Native worker owns all RF calls. */
    (void)esp32_mquickjs_wifi_smartconfig_service();
    JSValue value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &options_ref); return value;
fail:
    esp32_mquickjs_wifi_smartconfig_session_release(session);
    JS_PopGCRef(ctx, &result_ref); JS_PopGCRef(ctx, &options_ref); return JS_EXCEPTION;
}

static JSValue sc_bytes(JSContext *ctx, const uint8_t *bytes, size_t length)
{
    JSGCRef ref;
    JSValue *array = JS_PushGCRef(ctx, &ref);
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array)) goto fail;
    for (size_t i = 0; i < length; ++i)
        if (JS_IsException(JS_SetPropertyUint32(ctx, *array, i, JS_NewInt32(ctx, bytes[i])))) goto fail;
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
static JSValue sc_credentials_to_js(JSContext *ctx, esp32_mquickjs_wifi_smartconfig_session_t *session)
{
    esp32_mquickjs_wifi_smartconfig_credentials_t credentials = {0};
    esp_err_t error = esp32_mquickjs_wifi_smartconfig_session_credentials(session, &credentials, false);
    if (error != ESP_OK) return sc_error(ctx, "WiFiSmartConfigSession.receive", session, error, false);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    /* The SDK supplies fixed C-string fields, not lengths. Preserve all bytes
     * through the first NUL (or full capacity); never reinterpret as UTF-8. */
    SET(result, "ssidBytes", sc_bytes(ctx, credentials.network.ssid, strnlen((const char *)credentials.network.ssid, sizeof(credentials.network.ssid))));
    SET(result, "passwordBytes", sc_bytes(ctx, credentials.network.password, strnlen((const char *)credentials.network.password, sizeof(credentials.network.password))));
    const char *protocol = credentials.network.type == SC_TYPE_ESPTOUCH ? "esptouch" :
        credentials.network.type == SC_TYPE_AIRKISS ? "airkiss" : credentials.network.type == SC_TYPE_ESPTOUCH_V2 ? "esptouch-v2" : "esptouch-airkiss";
    SET(result, "protocol", JS_NewString(ctx, protocol));
    SET(result, "customDataBytes", credentials.network.type == SC_TYPE_ESPTOUCH_V2
        ? sc_bytes(ctx, credentials.custom_data, credentials.custom_length) : JS_NULL);
    char address[18];
    snprintf(address, sizeof(address), "%02x:%02x:%02x:%02x:%02x:%02x", credentials.network.bssid[0],
        credentials.network.bssid[1], credentials.network.bssid[2], credentials.network.bssid[3], credentials.network.bssid[4], credentials.network.bssid[5]);
    SET(result, "bssid", credentials.network.bssid_set ? JS_NewString(ctx, address) : JS_NULL);
    error = esp32_mquickjs_wifi_smartconfig_session_credentials(session, NULL, true);
    if (error != ESP_OK) { (void)sc_error(ctx, "WiFiSmartConfigSession.receive", session, error, false); goto fail; }
    esp32_mquickjs_wireless_secure_zero(&credentials, sizeof(credentials));
    return JS_PopGCRef(ctx, &ref);
fail:
    esp32_mquickjs_wireless_secure_zero(&credentials, sizeof(credentials));
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

