99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_smartconfig/esp32_mquickjs_wifi_smartconfig.c
static const char *sc_operation_name(sc_operation_t operation)
{ return operation == SC_RECEIVE ? "WiFiSmartConfigSession.receive" : "WiFiSmartConfigSession.close"; }
static void sc_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->observation_registered)
        esp32_mquickjs_wifi_smartconfig_session_wait_end(state->session, state->operation == SC_CLOSE);
    if (!state) return;
    esp32_mquickjs_wifi_smartconfig_session_release(state->session);
    esp32_mquickjs_memory_payload_free(state);
}
static bool sc_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out, sc_operation_t operation)
{
    *out = NULL;
    if (argc > 1) { JS_ThrowTypeError(ctx, "SmartConfig method expects optional timeout options"); return false; }
    esp32_mquickjs_wifi_smartconfig_session_t *session = sc_receiver(ctx, self->val);
    if (!session) return false;
    if (!esp32_mquickjs_wifi_smartconfig_session_retain(session)) { JS_ThrowInternalError(ctx, "SmartConfig reference exhausted"); return false; }
    bool valid = true;
    uint32_t timeout = 1000;
    if (argc && !JS_IsUndefined(argv[0].val)) {
        static const char *const keys[] = {"timeoutMs"};
        valid = esp32_mquickjs_validate_plain_options(ctx, argv[0].val, sc_operation_name(operation), keys, 1);
        if (valid) {
            JSGCRef ref;
            JSValue *field = JS_PushGCRef(ctx, &ref);
            *field = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
            valid = !JS_IsException(*field) && (JS_IsUndefined(*field) ||
                esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 3600000, &timeout));
            JS_PopGCRef(ctx, &ref);
        }
    }
    if (!valid) {
        esp32_mquickjs_wifi_smartconfig_session_release(session);
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid SmartConfig timeout options");
        return false;
    }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!state) { esp32_mquickjs_wifi_smartconfig_session_release(session); JS_ThrowOutOfMemory(ctx); return false; }
    state->session = session; state->operation = operation; state->timeout_ms = timeout;
    if (!esp32_mquickjs_wifi_smartconfig_session_wait_begin(session, operation == SC_CLOSE)) {
        sc_destroy(state); JS_ThrowInternalError(ctx, "SmartConfig waiter count exhausted"); return false;
    }
    state->observation_registered = true;
    *out = state; return true;
}
static bool sc_receive_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return sc_capture(ctx, self, argc, argv, out, SC_RECEIVE); }
static bool sc_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **out)
{ return sc_capture(ctx, self, argc, argv, out, SC_CLOSE); }
static bool sc_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)runtime; (void)token;
    int64_t now = esp_timer_get_time(), duration = (int64_t)state->timeout_ms * 1000;
    if (now < 0 || now > INT64_MAX - duration) { JS_ThrowInternalError(ctx, "SmartConfig clock exhausted"); return false; }
    state->started = true; state->deadline_us = now + duration;
    if (state->operation == SC_CLOSE) esp32_mquickjs_wifi_smartconfig_session_close(state->session, false);
    (void)esp32_mquickjs_wifi_smartconfig_service();
    return true;
}
static esp32_mquickjs_future_poll_t sc_poll(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->cancelled) return ESP32_MQUICKJS_FUTURE_READY;
    (void)esp32_mquickjs_wifi_smartconfig_service();
    esp32_mquickjs_wifi_smartconfig_session_status_t status;
    (void)esp32_mquickjs_wifi_smartconfig_session_status(state->session, &status);
    bool ready = state->operation == SC_CLOSE ? status.retired : status.error || status.closing ||
        status.credentials_consumed || (status.credentials_ready && !status.worker_busy && (!status.auto_connect || status.completed));
    if (!ready && state->operation == SC_RECEIVE && esp_timer_get_time() >= state->deadline_us) {
        state->wait_timed_out = true; ready = true;
    }
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}
static JSValue sc_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->operation == SC_CLOSE) return JS_UNDEFINED;
    if (state->wait_timed_out) return JS_NULL;
    esp32_mquickjs_wifi_smartconfig_session_status_t status;
    (void)esp32_mquickjs_wifi_smartconfig_session_status(state->session, &status);
    if (status.error || status.closing) return sc_error(ctx, sc_operation_name(state->operation), state->session, ESP_OK, false);
    if (status.credentials_consumed) return JS_ThrowReferenceError(ctx, "SmartConfig credentials already consumed");
    return sc_credentials_to_js(ctx, state->session);
}
static esp32_mquickjs_cancel_result_t sc_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    /* receive cancellation changes no native intent. Started close is already
     * retained by the registry; cancellation before start must not close. */
    return ESP32_MQUICKJS_CANCELLED;
}
static uint32_t sc_timeout(const esp32_mquickjs_future_driver_state_t *state)
{ return state->operation == SC_RECEIVE ? 0U : state->timeout_ms; }
static JSValue sc_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    (void)sc_cancel(state);
    return sc_error(ctx, sc_operation_name(state->operation), state->session, ESP_ERR_TIMEOUT, true);
}
#define SC_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = sc_start, .poll = sc_poll, .finish = sc_finish, \
    .cancel = sc_cancel, .destroy = sc_destroy, .timeout_ms = sc_timeout, .on_timeout = sc_on_timeout }
static const esp32_mquickjs_future_driver_t s_sc_receive_driver = SC_DRIVER(sc_receive_capture);
static const esp32_mquickjs_future_driver_t s_sc_close_driver = SC_DRIVER(sc_close_capture);
static JSValue sc_call(JSContext *ctx, JSValue *receiver, int argc, JSValue *argv, const char *name)
{
    JSGCRef self_ref, method_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *self = *receiver; *method = JS_GetPropertyStr(ctx, *self, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *self, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &self_ref); return result;
}
JSValue js_wifi_smartconfig_receive(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return sc_call(ctx, self, argc, argv, "receive"); }
JSValue js_wifi_smartconfig_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return sc_call(ctx, self, argc, argv, "close"); }
bool esp32_mquickjs_init_wifi_smartconfig_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, proto_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *proto = JS_PushGCRef(ctx, &proto_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiSmartConfigSession");
    if (JS_IsException(*object)) goto done;
    *proto = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*proto)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "receive");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_sc_receive_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *proto, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_sc_close_driver)) goto done;
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register SmartConfig runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &proto_ref); JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
